token = 'ВСТАВЬ_ТОКЕН_СЮДА'

game_name = 'за тобой'

main_guild_id = 537998356354433025
main_channel_id = 537998356354433027
command_channel_id = 623242038950756382
color_change_message_id = 624310020984799242
shuffle_roles_message_id = 624310022041501696
invite_create_message_id = 624310023094534155
create_voice_channel_id = 623978485597339658

basic_role_id_order = [
    623204401045045249,
    623223433848946709,
    622877397775024130,
    623206447030730792,
    622774777781813269,
    623206921331146794,
    623219991570939904,
    625755586541256720,
    647848644451500032,
    625697597809754133,
    623204122480476179,
    625699174603685888,
    625709284684201984,
    622774689345044480,
    622877629946658847,
    623222389072855063,
    623217032934195220,
]

shuffle_emoji = '🔄'
back_emoji = '🔙'
wait_emoji = '⏲'
invite_emoji = '➕'

invite_template = '''**Приглашение создано:**

`<url>`

Максимальное количество использований: `1`
Устареет через: `1 день`

Следующее приглашение возможно будет создать не ранее чем через `1 день`.'''

error_template = '''*<mention>, не смог отправить в ЛС, поэтому отправлю сюда:*

'''

welcome_message = f'''**Добро пожаловать, <mention>!**
<invite_detection_message>
Я выдал Вам случайную роль: <role>
Мой <#{command_channel_id}> позволит изменить эту роль, если потребуется. Также прошу ознакомиться с <#538001232770367489>.

:cactus: **Желаю приятного времяпрепровождения!** :cactus:'''

invite_detection_message = '''
Вы были приглашены пользователем: <inviter> <lol_message>
'''

lol_message = '''(<@!532953656073650177> - быдлокодер просто)'''

lore_channel_names = [
    'Аррен',
    'Баратеон',
    'Бейлиш',
    'Блэкфайр',
    'Болтон',
    'Грейджой',
    'Ланнистер',
    'Мартелл',
    'Старк',
    'Талли',
    'Таргариен',
    'Тирелл',
]
